11/data/attachments/b117c17d839b6dae.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Karen_back_Friend_26141_2</nif:username>
            <nif:friendToBeRequested>soap_friends_bc6b9d0a-cce8-45c1-9daa-78db7992207a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>